{"class_name": "Model", "config": {"name": "model_32", "layers": [{"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36, 1], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "input_50", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 72, 1], "dtype": "float32", "sparse": false, "name": "input_50"}, "inbound_nodes": []}, {"name": "input_51", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 1], "dtype": "float32", "sparse": false, "name": "input_51"}, "inbound_nodes": []}, {"name": "input_52", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 1], "dtype": "float32", "sparse": false, "name": "input_52"}, "inbound_nodes": []}, {"name": "model_28", "class_name": "Model", "config": {"name": "model_28", "layers": [{"name": "input_53", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36, 1], "dtype": "float32", "sparse": false, "name": "input_53"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}], "input_layers": [["input_53", 0, 0]], "output_layers": [["flatten_1", 0, 0]]}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "model_29", "class_name": "Model", "config": {"name": "model_29", "layers": [{"name": "input_54", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 72, 1], "dtype": "float32", "sparse": false, "name": "input_54"}, "inbound_nodes": []}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 72, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": [["input_54", 0, 0]], "output_layers": [["flatten_2", 0, 0]]}, "inbound_nodes": [[["input_50", 0, 0, {}]]]}, {"name": "model_30", "class_name": "Model", "config": {"name": "model_30", "layers": [{"name": "input_55", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 1], "dtype": "float32", "sparse": false, "name": "input_55"}, "inbound_nodes": []}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 144, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}], "input_layers": [["input_55", 0, 0]], "output_layers": [["flatten_3", 0, 0]]}, "inbound_nodes": [[["input_51", 0, 0, {}]]]}, {"name": "model_31", "class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "input_56", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 1], "dtype": "float32", "sparse": false, "name": "input_56"}, "inbound_nodes": []}, {"name": "lstm_4", "class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 144, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_56", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}], "input_layers": [["input_56", 0, 0]], "output_layers": [["flatten_4", 0, 0]]}, "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["model_28", 1, 0, {}], ["model_29", 1, 0, {}], ["model_30", 1, 0, {}], ["model_31", 1, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "units": 18, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}], "input_layers": [["input_49", 0, 0], ["input_50", 0, 0], ["input_51", 0, 0], ["input_52", 0, 0]], "output_layers": [["dense_28", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}